Repository: xima-media/xima-api-client
Catalog: Resources/Private/Language/*.locallang_*.xlf
Languages: de

# tx_ximaapiclient_request.description
source: Select a suitable reusable request as data source for the to be rendered template. If no reusable request is available for selection, allow the selected template within the reusable request configuration in the API Client module.
de: Wählen Sie einen geeigneten Reusable Request als Datenquelle für das zu rendernde Template. Sollte kein Reusable Request zur Auswahl stehen, erlauben sie das gewählte Template innerhalb der Konfiguration der Reusable Requests im API Client Modul.

# tx_ximaapiclient_template
source: Registered template
de: Registrierte Templates

# tx_ximaapiclient_template.description
source: Select a fluid template for rendering the api data from the selected reusable request.
de: Wählen Sie ein Template für die Darstellung der API-Daten aus dem ausgewählten Reusable Request.

# tx_ximaapiclient_detail_pid
source: PageId for single item display
de: PageId für die Anzeige einzelner Datensätze

# tx_ximaapiclient_pagination
source: Pagination
de: Paginierung

# tx_ximaapiclient_pagination_page_parameter
source: Page parameter
de: Seitenparameter

# tx_ximaapiclient_pagination_page_parameter.description
source: Select the parameter handling the pagination in the API. Remember to also select it as an overridable parameter below.
de: Wählen Sie den Parameter aus, der die Paginierung in der API steuert. Denken Sie daran, ihn unten auch als überschreibbaren Parameter auszuwählen.

# tx_ximaapiclient_registeredtemplates.debug.description
source: This is the debug template for providing a technical entry using the api client extension within the frontend.
de: Dies ist die Debug-Vorlage für die Bereitstellung eines technischen Eintrags unter Verwendung der "Api Client" Extension im Frontend.

# tx_ximaapiclient_backendmodule.request.reusable_request
source: Reusable Request
de: Wiederverwendbarer Request

# tx_ximaapiclient_backendmodule.request.temporary_request
source: Temporary Request
de: Temporärer Request
